In [16]:
import pandas as pd

In [17]:
df=pd.read_csv("weatherdata.csv")

In [18]:
df

         day  temperature  event
0  20/4/2023           30  sunny
1  21/4/2023           25  windy
2  22/4/2023           18  Rainy

In [19]:
df=pd.read_excel("weatherdata.xlsx","Sheet1")
df

         day  temperature  event
0  20/4/2023           30  sunny
1  21/4/2023           25  windy
2  22/4/2023           18  Rainy

In [20]:
dob={"Name":['Neha','Yash'],"Bday":['30 sep',"12 Mar"]}
df=pd.DataFrame(dob)
df

   Name    Bday
0  Neha  30 sep
1  Yash  12 Mar

In [21]:
weather_data = [
    ('1/1/2017',32,6,'Rain'),
    ('1/2/2017',35,7,'Sunny'),
    ('1/3/2017',28,2,'Snow')
]
df = pd.DataFrame(data=weather_data, columns=['day','temperature','windspeed','event'])
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [22]:
weather_data = [
    {'day': '1/1/2017', 'temperature': 32, 'windspeed': 6, 'event': 'Rain'},
    {'day': '1/2/2017', 'temperature': 35, 'windspeed': 7, 'event': 'Sunny'},
    {'day': '1/3/2017', 'temperature': 28, 'windspeed': 2, 'event': 'Snow'},
    
]
df = pd.DataFrame(data=weather_data)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [26]:
import numpy as np
sp=numpy.array([[34,43,73],[82,33,45],[53,94,66]])
sp

array([[34, 43, 73],
       [82, 33, 45],
       [53, 94, 66]])

In [27]:
sp_tp = sp.transpose()

In [28]:
df = pd.DataFrame({'col1': sp_tp[0], 'col2': sp_tp[1]})

In [29]:
df

   col1  col2
0    34    43
1    82    33
2    53    94

In [13]:
array = np.array([[1, 1, 1], [2, 4, 8], [3, 9, 27], 
                  [4, 16, 64], [5, 25, 125], [6, 36, 216], 
                  [7, 49, 343]])

In [30]:
# creating a list of index names
index_values = ['first', 'second', 'third',
                'fourth', 'fifth', 'sixth', 'seventh']
   
# creating a list of column names
column_values = ['number', 'squares', 'cubes']
  
# creating the dataframe
df = pd.DataFrame(data = array, 
                  index = index_values, 
                  columns = column_values)

In [15]:
df

         number  squares  cubes
first         1        1      1
second        2        4      8
third         3        9     27
fourth        4       16     64
fifth         5       25    125
sixth         6       36    216
seventh       7       49    343

In [1]:
normalized_df=(df-df.min())/(df.max()-df.min())

NameError: name 'df' is not defined